In [16]:
import pandas as pd

In [18]:
df = pd.read_csv("https://raw.githubusercontent.com/dsrscientist/DSData/master/Employees.csv")

In [19]:
df.head()

,NAME,JOB TITLE,DEPARTMENT,EMPLOYEE ANNUAL SALARY,ESTIMATED ANNUAL SALARY MINUS FURLOUGHS
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$81000.00,$73862.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$74628.00,$74628.00
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,FLEET MANAGEMNT,$77280.00,$70174.00
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$96276.00,$96276.00
4,"ABBATACOLA, ROBERT J",ELECTRICAL MECHANIC,WATER MGMNT,$84032.00,$76627.00

In [25]:
df2 = pd.read_csv(r"https://raw.githubusercontent.com/dsrscientist/DSData/master/Restaurant_Reviews.tsv",sep="/t")

<ipython-input-25-d3112a28e260>:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  df2 = pd.read_csv(r"https://raw.githubusercontent.com/dsrscientist/DSData/master/Restaurant_Reviews.tsv",sep="/t")

In [27]:
df2.head()

                                       Review\tLiked
0                        Wow... Loved this place.\t1
1                              Crust is not good.\t0
2       Not tasty and the texture was just nasty.\t0
3  Stopped by during the late May bank holiday of...
4  The selection on the menu was great and so wer...